Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/nvm.h
/*
 * Component description for NVM
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-05-31T11:02:56Z */
#ifndef _BZ25_NVM_COMPONENT_H_
#define _BZ25_NVM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR NVM                                          */
/* ************************************************************************** */

/* -------- NVM_NVMCON : (NVM Offset: 0x00) (R/W 32)  -------- */
#define NVM_NVMCON_RESETVALUE                 _UINT32_(0x00)                                       /*  (NVM_NVMCON)   Reset Value */

#define NVM_NVMCON_NVMOP_Pos                  _UINT32_(0)                                          /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_NVMOP_Msk                  (_UINT32_(0xF) << NVM_NVMCON_NVMOP_Pos)              /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_NVMOP(value)               (NVM_NVMCON_NVMOP_Msk & (_UINT32_(value) << NVM_NVMCON_NVMOP_Pos)) /* Assigment of value for NVMOP in the NVM_NVMCON register */
#define NVM_NVMCON_BFSWAP_Pos                 _UINT32_(6)                                          /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_BFSWAP_Msk                 (_UINT32_(0x1) << NVM_NVMCON_BFSWAP_Pos)             /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_BFSWAP(value)              (NVM_NVMCON_BFSWAP_Msk & (_UINT32_(value) << NVM_NVMCON_BFSWAP_Pos)) /* Assigment of value for BFSWAP in the NVM_NVMCON register */
#define NVM_NVMCON_PFSWAP_Pos                 _UINT32_(7)                                          /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_PFSWAP_Msk                 (_UINT32_(0x1) << NVM_NVMCON_PFSWAP_Pos)             /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_PFSWAP(value)              (NVM_NVMCON_PFSWAP_Msk & (_UINT32_(value) << NVM_NVMCON_PFSWAP_Pos)) /* Assigment of value for PFSWAP in the NVM_NVMCON register */
#define NVM_NVMCON_HTDPGM_Pos                 _UINT32_(8)                                          /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_HTDPGM_Msk                 (_UINT32_(0x1) << NVM_NVMCON_HTDPGM_Pos)             /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_HTDPGM(value)              (NVM_NVMCON_HTDPGM_Msk & (_UINT32_(value) << NVM_NVMCON_HTDPGM_Pos)) /* Assigment of value for HTDPGM in the NVM_NVMCON register */
#define NVM_NVMCON_LVDERR_Pos                 _UINT32_(12)                                         /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_LVDERR_Msk                 (_UINT32_(0x1) << NVM_NVMCON_LVDERR_Pos)             /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_LVDERR(value)              (NVM_NVMCON_LVDERR_Msk & (_UINT32_(value) << NVM_NVMCON_LVDERR_Pos)) /* Assigment of value for LVDERR in the NVM_NVMCON register */
#define NVM_NVMCON_WRERR_Pos                  _UINT32_(13)                                         /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_WRERR_Msk                  (_UINT32_(0x1) << NVM_NVMCON_WRERR_Pos)              /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_WRERR(value)               (NVM_NVMCON_WRERR_Msk & (_UINT32_(value) << NVM_NVMCON_WRERR_Pos)) /* Assigment of value for WRERR in the NVM_NVMCON register */
#define NVM_NVMCON_WREN_Pos                   _UINT32_(14)                                         /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_WREN_Msk                   (_UINT32_(0x1) << NVM_NVMCON_WREN_Pos)               /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_WREN(value)                (NVM_NVMCON_WREN_Msk & (_UINT32_(value) << NVM_NVMCON_WREN_Pos)) /* Assigment of value for WREN in the NVM_NVMCON register */
#define NVM_NVMCON_WR_Pos                     _UINT32_(15)                                         /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_WR_Msk                     (_UINT32_(0x1) << NVM_NVMCON_WR_Pos)                 /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_WR(value)                  (NVM_NVMCON_WR_Msk & (_UINT32_(value) << NVM_NVMCON_WR_Pos)) /* Assigment of value for WR in the NVM_NVMCON register */
#define NVM_NVMCON_Msk                        _UINT32_(0x0000F1CF)                                 /* (NVM_NVMCON) Register Mask  */


/* -------- NVM_NVMCONCLR : (NVM Offset: 0x04) (R/W 32)  -------- */
#define NVM_NVMCONCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (NVM_NVMCONCLR)   Reset Value */

#define NVM_NVMCONCLR_Msk                     _UINT32_(0x00000000)                                 /* (NVM_NVMCONCLR) Register Mask  */


/* -------- NVM_NVMCONSET : (NVM Offset: 0x08) (R/W 32)  -------- */
#define NVM_NVMCONSET_RESETVALUE              _UINT32_(0x00)                                       /*  (NVM_NVMCONSET)   Reset Value */

#define NVM_NVMCONSET_Msk                     _UINT32_(0x00000000)                                 /* (NVM_NVMCONSET) Register Mask  */


/* -------- NVM_NVMCONINV : (NVM Offset: 0x0C) (R/W 32)  -------- */
#define NVM_NVMCONINV_RESETVALUE              _UINT32_(0x00)                                       /*  (NVM_NVMCONINV)   Reset Value */

