Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/nvm.h
#define NVM_NVMCONINV_Msk                     _UINT32_(0x00000000)                                 /* (NVM_NVMCONINV) Register Mask  */


/* -------- NVM_NVMCON2 : (NVM Offset: 0x10) (R/W 32)  -------- */
#define NVM_NVMCON2_RESETVALUE                _UINT32_(0x00)                                       /*  (NVM_NVMCON2)   Reset Value */

#define NVM_NVMCON2_PREPG_Pos                 _UINT32_(0)                                          /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_PREPG_Msk                 (_UINT32_(0x1) << NVM_NVMCON2_PREPG_Pos)             /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_PREPG(value)              (NVM_NVMCON2_PREPG_Msk & (_UINT32_(value) << NVM_NVMCON2_PREPG_Pos)) /* Assigment of value for PREPG in the NVM_NVMCON2 register */
#define NVM_NVMCON2_SWAPLK_Pos                _UINT32_(6)                                          /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_SWAPLK_Msk                (_UINT32_(0x3) << NVM_NVMCON2_SWAPLK_Pos)            /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_SWAPLK(value)             (NVM_NVMCON2_SWAPLK_Msk & (_UINT32_(value) << NVM_NVMCON2_SWAPLK_Pos)) /* Assigment of value for SWAPLK in the NVM_NVMCON2 register */
#define NVM_NVMCON2_RETRY_Pos                 _UINT32_(8)                                          /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_RETRY_Msk                 (_UINT32_(0x3) << NVM_NVMCON2_RETRY_Pos)             /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_RETRY(value)              (NVM_NVMCON2_RETRY_Msk & (_UINT32_(value) << NVM_NVMCON2_RETRY_Pos)) /* Assigment of value for RETRY in the NVM_NVMCON2 register */
#define NVM_NVMCON2_VREAD1_Pos                _UINT32_(12)                                         /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_VREAD1_Msk                (_UINT32_(0x1) << NVM_NVMCON2_VREAD1_Pos)            /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_VREAD1(value)             (NVM_NVMCON2_VREAD1_Msk & (_UINT32_(value) << NVM_NVMCON2_VREAD1_Pos)) /* Assigment of value for VREAD1 in the NVM_NVMCON2 register */
#define NVM_NVMCON2_CREAD1_Pos                _UINT32_(13)                                         /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_CREAD1_Msk                (_UINT32_(0x1) << NVM_NVMCON2_CREAD1_Pos)            /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_CREAD1(value)             (NVM_NVMCON2_CREAD1_Msk & (_UINT32_(value) << NVM_NVMCON2_CREAD1_Pos)) /* Assigment of value for CREAD1 in the NVM_NVMCON2 register */
#define NVM_NVMCON2_TEMP_Pos                  _UINT32_(14)                                         /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_TEMP_Msk                  (_UINT32_(0x1) << NVM_NVMCON2_TEMP_Pos)              /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_TEMP(value)               (NVM_NVMCON2_TEMP_Msk & (_UINT32_(value) << NVM_NVMCON2_TEMP_Pos)) /* Assigment of value for TEMP in the NVM_NVMCON2 register */
#define NVM_NVMCON2_WS_Pos                    _UINT32_(16)                                         /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_WS_Msk                    (_UINT32_(0x1F) << NVM_NVMCON2_WS_Pos)               /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_WS(value)                 (NVM_NVMCON2_WS_Msk & (_UINT32_(value) << NVM_NVMCON2_WS_Pos)) /* Assigment of value for WS in the NVM_NVMCON2 register */
#define NVM_NVMCON2_SLEEP_Pos                 _UINT32_(24)                                         /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_SLEEP_Msk                 (_UINT32_(0x1) << NVM_NVMCON2_SLEEP_Pos)             /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_SLEEP(value)              (NVM_NVMCON2_SLEEP_Msk & (_UINT32_(value) << NVM_NVMCON2_SLEEP_Pos)) /* Assigment of value for SLEEP in the NVM_NVMCON2 register */
#define NVM_NVMCON2_ERS_Pos                   _UINT32_(28)                                         /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_ERS_Msk                   (_UINT32_(0xF) << NVM_NVMCON2_ERS_Pos)               /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_ERS(value)                (NVM_NVMCON2_ERS_Msk & (_UINT32_(value) << NVM_NVMCON2_ERS_Pos)) /* Assigment of value for ERS in the NVM_NVMCON2 register */
#define NVM_NVMCON2_Msk                       _UINT32_(0xF11F73C1)                                 /* (NVM_NVMCON2) Register Mask  */

#define NVM_NVMCON2_VREAD_Pos                 _UINT32_(12)                                         /* (NVM_NVMCON2 Position)  */
#define NVM_NVMCON2_VREAD_Msk                 (_UINT32_(0x1) << NVM_NVMCON2_VREAD_Pos)             /* (NVM_NVMCON2 Mask) VREAD */
#define NVM_NVMCON2_VREAD(value)              (NVM_NVMCON2_VREAD_Msk & (_UINT32_(value) << NVM_NVMCON2_VREAD_Pos)) 
#define NVM_NVMCON2_CREAD_Pos                 _UINT32_(13)                                         /* (NVM_NVMCON2 Position)  */
#define NVM_NVMCON2_CREAD_Msk                 (_UINT32_(0x1) << NVM_NVMCON2_CREAD_Pos)             /* (NVM_NVMCON2 Mask) CREAD */
#define NVM_NVMCON2_CREAD(value)              (NVM_NVMCON2_CREAD_Msk & (_UINT32_(value) << NVM_NVMCON2_CREAD_Pos)) 

/* -------- NVM_NVMCON2CLR : (NVM Offset: 0x14) (R/W 32)  -------- */
#define NVM_NVMCON2CLR_RESETVALUE             _UINT32_(0x00)                                       /*  (NVM_NVMCON2CLR)   Reset Value */

#define NVM_NVMCON2CLR_Msk                    _UINT32_(0x00000000)                                 /* (NVM_NVMCON2CLR) Register Mask  */


/* -------- NVM_NVMCON2SET : (NVM Offset: 0x18) (R/W 32)  -------- */
#define NVM_NVMCON2SET_RESETVALUE             _UINT32_(0x00)                                       /*  (NVM_NVMCON2SET)   Reset Value */

#define NVM_NVMCON2SET_Msk                    _UINT32_(0x00000000)                                 /* (NVM_NVMCON2SET) Register Mask  */


/* -------- NVM_NVMCON2INV : (NVM Offset: 0x1C) (R/W 32)  -------- */
#define NVM_NVMCON2INV_RESETVALUE             _UINT32_(0x00)                                       /*  (NVM_NVMCON2INV)   Reset Value */

#define NVM_NVMCON2INV_Msk                    _UINT32_(0x00000000)                                 /* (NVM_NVMCON2INV) Register Mask  */


