Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/nvm.h
/* -------- NVM_NVMKEY : (NVM Offset: 0x20) (R/W 32)  -------- */
#define NVM_NVMKEY_RESETVALUE                 _UINT32_(0x00)                                       /*  (NVM_NVMKEY)   Reset Value */

#define NVM_NVMKEY_NVMKEY_Pos                 _UINT32_(0)                                          /* (NVM_NVMKEY)  Position */
#define NVM_NVMKEY_NVMKEY_Msk                 (_UINT32_(0xFFFFFFFF) << NVM_NVMKEY_NVMKEY_Pos)      /* (NVM_NVMKEY)  Mask */
#define NVM_NVMKEY_NVMKEY(value)              (NVM_NVMKEY_NVMKEY_Msk & (_UINT32_(value) << NVM_NVMKEY_NVMKEY_Pos)) /* Assigment of value for NVMKEY in the NVM_NVMKEY register */
#define NVM_NVMKEY_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMKEY) Register Mask  */


/* -------- NVM_NVMADDR : (NVM Offset: 0x30) (R/W 32)  -------- */
#define NVM_NVMADDR_RESETVALUE                _UINT32_(0x00)                                       /*  (NVM_NVMADDR)   Reset Value */

#define NVM_NVMADDR_NVMADDR_Pos               _UINT32_(0)                                          /* (NVM_NVMADDR)  Position */
#define NVM_NVMADDR_NVMADDR_Msk               (_UINT32_(0xFFFFFFFF) << NVM_NVMADDR_NVMADDR_Pos)    /* (NVM_NVMADDR)  Mask */
#define NVM_NVMADDR_NVMADDR(value)            (NVM_NVMADDR_NVMADDR_Msk & (_UINT32_(value) << NVM_NVMADDR_NVMADDR_Pos)) /* Assigment of value for NVMADDR in the NVM_NVMADDR register */
#define NVM_NVMADDR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMADDR) Register Mask  */


/* -------- NVM_NVMDATA0 : (NVM Offset: 0x40) (R/W 32)  -------- */
#define NVM_NVMDATA0_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA0)   Reset Value */

#define NVM_NVMDATA0_NVMDATA0_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA0)  Position */
#define NVM_NVMDATA0_NVMDATA0_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA0_NVMDATA0_Pos)  /* (NVM_NVMDATA0)  Mask */
#define NVM_NVMDATA0_NVMDATA0(value)          (NVM_NVMDATA0_NVMDATA0_Msk & (_UINT32_(value) << NVM_NVMDATA0_NVMDATA0_Pos)) /* Assigment of value for NVMDATA0 in the NVM_NVMDATA0 register */
#define NVM_NVMDATA0_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA0) Register Mask  */


/* -------- NVM_NVMDATA1 : (NVM Offset: 0x50) (R/W 32)  -------- */
#define NVM_NVMDATA1_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA1)   Reset Value */

#define NVM_NVMDATA1_NVMDATA1_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA1)  Position */
#define NVM_NVMDATA1_NVMDATA1_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA1_NVMDATA1_Pos)  /* (NVM_NVMDATA1)  Mask */
#define NVM_NVMDATA1_NVMDATA1(value)          (NVM_NVMDATA1_NVMDATA1_Msk & (_UINT32_(value) << NVM_NVMDATA1_NVMDATA1_Pos)) /* Assigment of value for NVMDATA1 in the NVM_NVMDATA1 register */
#define NVM_NVMDATA1_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA1) Register Mask  */


/* -------- NVM_NVMDATA2 : (NVM Offset: 0x60) (R/W 32)  -------- */
#define NVM_NVMDATA2_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA2)   Reset Value */

#define NVM_NVMDATA2_NVMDATA2_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA2)  Position */
#define NVM_NVMDATA2_NVMDATA2_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA2_NVMDATA2_Pos)  /* (NVM_NVMDATA2)  Mask */
#define NVM_NVMDATA2_NVMDATA2(value)          (NVM_NVMDATA2_NVMDATA2_Msk & (_UINT32_(value) << NVM_NVMDATA2_NVMDATA2_Pos)) /* Assigment of value for NVMDATA2 in the NVM_NVMDATA2 register */
#define NVM_NVMDATA2_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA2) Register Mask  */


/* -------- NVM_NVMDATA3 : (NVM Offset: 0x70) (R/W 32)  -------- */
#define NVM_NVMDATA3_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA3)   Reset Value */

#define NVM_NVMDATA3_NVMDATA3_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA3)  Position */
#define NVM_NVMDATA3_NVMDATA3_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA3_NVMDATA3_Pos)  /* (NVM_NVMDATA3)  Mask */
#define NVM_NVMDATA3_NVMDATA3(value)          (NVM_NVMDATA3_NVMDATA3_Msk & (_UINT32_(value) << NVM_NVMDATA3_NVMDATA3_Pos)) /* Assigment of value for NVMDATA3 in the NVM_NVMDATA3 register */
#define NVM_NVMDATA3_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA3) Register Mask  */


/* -------- NVM_NVMDATA4 : (NVM Offset: 0x80) (R/W 32)  -------- */
#define NVM_NVMDATA4_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA4)   Reset Value */

#define NVM_NVMDATA4_NVMDATA4_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA4)  Position */
#define NVM_NVMDATA4_NVMDATA4_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA4_NVMDATA4_Pos)  /* (NVM_NVMDATA4)  Mask */
#define NVM_NVMDATA4_NVMDATA4(value)          (NVM_NVMDATA4_NVMDATA4_Msk & (_UINT32_(value) << NVM_NVMDATA4_NVMDATA4_Pos)) /* Assigment of value for NVMDATA4 in the NVM_NVMDATA4 register */
#define NVM_NVMDATA4_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA4) Register Mask  */


/* -------- NVM_NVMDATA5 : (NVM Offset: 0x90) (R/W 32)  -------- */
#define NVM_NVMDATA5_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA5)   Reset Value */

#define NVM_NVMDATA5_NVMDATA5_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA5)  Position */
#define NVM_NVMDATA5_NVMDATA5_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA5_NVMDATA5_Pos)  /* (NVM_NVMDATA5)  Mask */
#define NVM_NVMDATA5_NVMDATA5(value)          (NVM_NVMDATA5_NVMDATA5_Msk & (_UINT32_(value) << NVM_NVMDATA5_NVMDATA5_Pos)) /* Assigment of value for NVMDATA5 in the NVM_NVMDATA5 register */
#define NVM_NVMDATA5_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA5) Register Mask  */


/* -------- NVM_NVMDATA6 : (NVM Offset: 0xA0) (R/W 32)  -------- */
#define NVM_NVMDATA6_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA6)   Reset Value */

#define NVM_NVMDATA6_NVMDATA6_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA6)  Position */
#define NVM_NVMDATA6_NVMDATA6_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA6_NVMDATA6_Pos)  /* (NVM_NVMDATA6)  Mask */
#define NVM_NVMDATA6_NVMDATA6(value)          (NVM_NVMDATA6_NVMDATA6_Msk & (_UINT32_(value) << NVM_NVMDATA6_NVMDATA6_Pos)) /* Assigment of value for NVMDATA6 in the NVM_NVMDATA6 register */
#define NVM_NVMDATA6_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA6) Register Mask  */


