Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/nvm.h
/* -------- NVM_NVMDATA7 : (NVM Offset: 0xB0) (R/W 32)  -------- */
#define NVM_NVMDATA7_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA7)   Reset Value */

#define NVM_NVMDATA7_NVMDATA7_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA7)  Position */
#define NVM_NVMDATA7_NVMDATA7_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA7_NVMDATA7_Pos)  /* (NVM_NVMDATA7)  Mask */
#define NVM_NVMDATA7_NVMDATA7(value)          (NVM_NVMDATA7_NVMDATA7_Msk & (_UINT32_(value) << NVM_NVMDATA7_NVMDATA7_Pos)) /* Assigment of value for NVMDATA7 in the NVM_NVMDATA7 register */
#define NVM_NVMDATA7_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA7) Register Mask  */


/* -------- NVM_NVMSRCADDR : (NVM Offset: 0xC0) (R/W 32)  -------- */
#define NVM_NVMSRCADDR_RESETVALUE             _UINT32_(0x00)                                       /*  (NVM_NVMSRCADDR)   Reset Value */

#define NVM_NVMSRCADDR_NVMSRCADDR_Pos         _UINT32_(0)                                          /* (NVM_NVMSRCADDR)  Position */
#define NVM_NVMSRCADDR_NVMSRCADDR_Msk         (_UINT32_(0xFFFFFFFF) << NVM_NVMSRCADDR_NVMSRCADDR_Pos) /* (NVM_NVMSRCADDR)  Mask */
#define NVM_NVMSRCADDR_NVMSRCADDR(value)      (NVM_NVMSRCADDR_NVMSRCADDR_Msk & (_UINT32_(value) << NVM_NVMSRCADDR_NVMSRCADDR_Pos)) /* Assigment of value for NVMSRCADDR in the NVM_NVMSRCADDR register */
#define NVM_NVMSRCADDR_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMSRCADDR) Register Mask  */


/* -------- NVM_NVMPWPLT : (NVM Offset: 0xD0) (R/W 32)  -------- */
#define NVM_NVMPWPLT_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMPWPLT)   Reset Value */

#define NVM_NVMPWPLT_PWPLT_Pos                _UINT32_(0)                                          /* (NVM_NVMPWPLT)  Position */
#define NVM_NVMPWPLT_PWPLT_Msk                (_UINT32_(0xFFFFFF) << NVM_NVMPWPLT_PWPLT_Pos)       /* (NVM_NVMPWPLT)  Mask */
#define NVM_NVMPWPLT_PWPLT(value)             (NVM_NVMPWPLT_PWPLT_Msk & (_UINT32_(value) << NVM_NVMPWPLT_PWPLT_Pos)) /* Assigment of value for PWPLT in the NVM_NVMPWPLT register */
#define NVM_NVMPWPLT_ULOCK_Pos                _UINT32_(31)                                         /* (NVM_NVMPWPLT)  Position */
#define NVM_NVMPWPLT_ULOCK_Msk                (_UINT32_(0x1) << NVM_NVMPWPLT_ULOCK_Pos)            /* (NVM_NVMPWPLT)  Mask */
#define NVM_NVMPWPLT_ULOCK(value)             (NVM_NVMPWPLT_ULOCK_Msk & (_UINT32_(value) << NVM_NVMPWPLT_ULOCK_Pos)) /* Assigment of value for ULOCK in the NVM_NVMPWPLT register */
#define NVM_NVMPWPLT_Msk                      _UINT32_(0x80FFFFFF)                                 /* (NVM_NVMPWPLT) Register Mask  */


/* -------- NVM_NVMPWPLTCLR : (NVM Offset: 0xD4) (R/W 32)  -------- */
#define NVM_NVMPWPLTCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (NVM_NVMPWPLTCLR)   Reset Value */

#define NVM_NVMPWPLTCLR_Msk                   _UINT32_(0x00000000)                                 /* (NVM_NVMPWPLTCLR) Register Mask  */


/* -------- NVM_NVMPWPLTSET : (NVM Offset: 0xD8) (R/W 32)  -------- */
#define NVM_NVMPWPLTSET_RESETVALUE            _UINT32_(0x00)                                       /*  (NVM_NVMPWPLTSET)   Reset Value */

#define NVM_NVMPWPLTSET_Msk                   _UINT32_(0x00000000)                                 /* (NVM_NVMPWPLTSET) Register Mask  */


/* -------- NVM_NVMPWPLTINV : (NVM Offset: 0xDC) (R/W 32)  -------- */
#define NVM_NVMPWPLTINV_RESETVALUE            _UINT32_(0x00)                                       /*  (NVM_NVMPWPLTINV)   Reset Value */

#define NVM_NVMPWPLTINV_Msk                   _UINT32_(0x00000000)                                 /* (NVM_NVMPWPLTINV) Register Mask  */


/* -------- NVM_NVMPWPGTE : (NVM Offset: 0xE0) (R/W 32)  -------- */
#define NVM_NVMPWPGTE_RESETVALUE              _UINT32_(0x00)                                       /*  (NVM_NVMPWPGTE)   Reset Value */

#define NVM_NVMPWPGTE_PWPGTE_Pos              _UINT32_(0)                                          /* (NVM_NVMPWPGTE)  Position */
#define NVM_NVMPWPGTE_PWPGTE_Msk              (_UINT32_(0xFFFFFF) << NVM_NVMPWPGTE_PWPGTE_Pos)     /* (NVM_NVMPWPGTE)  Mask */
#define NVM_NVMPWPGTE_PWPGTE(value)           (NVM_NVMPWPGTE_PWPGTE_Msk & (_UINT32_(value) << NVM_NVMPWPGTE_PWPGTE_Pos)) /* Assigment of value for PWPGTE in the NVM_NVMPWPGTE register */
#define NVM_NVMPWPGTE_ULOCK_Pos               _UINT32_(31)                                         /* (NVM_NVMPWPGTE)  Position */
#define NVM_NVMPWPGTE_ULOCK_Msk               (_UINT32_(0x1) << NVM_NVMPWPGTE_ULOCK_Pos)           /* (NVM_NVMPWPGTE)  Mask */
#define NVM_NVMPWPGTE_ULOCK(value)            (NVM_NVMPWPGTE_ULOCK_Msk & (_UINT32_(value) << NVM_NVMPWPGTE_ULOCK_Pos)) /* Assigment of value for ULOCK in the NVM_NVMPWPGTE register */
#define NVM_NVMPWPGTE_Msk                     _UINT32_(0x80FFFFFF)                                 /* (NVM_NVMPWPGTE) Register Mask  */


/* -------- NVM_NVMPWPGTECLR : (NVM Offset: 0xE4) (R/W 32)  -------- */
#define NVM_NVMPWPGTECLR_RESETVALUE           _UINT32_(0x00)                                       /*  (NVM_NVMPWPGTECLR)   Reset Value */

#define NVM_NVMPWPGTECLR_Msk                  _UINT32_(0x00000000)                                 /* (NVM_NVMPWPGTECLR) Register Mask  */


/* -------- NVM_NVMPWPGTESET : (NVM Offset: 0xE8) (R/W 32)  -------- */
#define NVM_NVMPWPGTESET_RESETVALUE           _UINT32_(0x00)                                       /*  (NVM_NVMPWPGTESET)   Reset Value */

#define NVM_NVMPWPGTESET_Msk                  _UINT32_(0x00000000)                                 /* (NVM_NVMPWPGTESET) Register Mask  */


/* -------- NVM_NVMPWPGTEINV : (NVM Offset: 0xEC) (R/W 32)  -------- */
#define NVM_NVMPWPGTEINV_RESETVALUE           _UINT32_(0x00)                                       /*  (NVM_NVMPWPGTEINV)   Reset Value */

#define NVM_NVMPWPGTEINV_Msk                  _UINT32_(0x00000000)                                 /* (NVM_NVMPWPGTEINV) Register Mask  */


